{
  "title": "Portfolio — Leonardo Benvinda",
  "nav_about": "About",
  "nav_projects": "Projects",
  "nav_contact": "Contacts and Social Media",
  "cat_academic": "Academic",
  "cat_professional": "Professional",
  "cat_personal": "Personal",
  "hero_title": "Leonardo Benvinda",
  "hero_sub": "Bachelor's degree in Computer Engineering.",
  "btn_view_projects": "Projects",
  "btn_contact": "Contacts and Social Media",
  "about_title": "About",
  "about_text": "I have been passionate about technology for as long as I can remember. My interests are as varied as software development, IoT, Artificial Intelligence, systems administration, hardware repair and maintenance, among other areas. I enjoy practical challenges, but I also highly value the theory and planning behind a good project. I believe that technology should be used to improve people's lives, and I am always looking for new ways to learn and grow in this ever-evolving field. The different types of projects I have developed over the years reflect my curiosity for various areas. I recently completed my bachelor's degree in Computer Engineering, where I acquired and deepened knowledge in several areas, and I am now looking for my first professional experience in the field.",
  
  "education_title": "Education",
  "edu_1_degree": "Bachelor's Degree in Computer Engineering",
  "edu_1_institution": "School of Technology and Management - Polytechnic Institute of Beja",
  "edu_1_years": "2022 — 2025",
  "edu_1_desc": "Highly practical course with an emphasis on object-oriented programming (OOP), web development, and scripting. Final project: Development of a mobile video surveillance solution with real-time streaming and remote control via a web application - Grade: 20/20. Final Average: 16/20.",
  "edu_2_degree": "High School - Management Informatics Technician",
  "edu_2_institution": "Escola Tecnológica do Litoral Alentejano (ETLA)",
  "edu_2_years": "2015 — 2018",
  "edu_2_desc": "Main focus on object-oriented programming and databases. Final Project: Management software for a medical clinic - Grade: 19/20. Final Average: 16/20.",
  
  "positions_title": "Professional Experience",
  "pos_1_title": "IT Technician",
  "pos_1_company": "Escola Tecnológica do Litoral Alentejano (ETLA)",
  "pos_1_years": "2019 — 2022",
  "pos_1_desc": "Development of internal management applications. Installation, maintenance, and repair of hardware and software on school computers and networks. Technical support for students and teachers. Preparation, configuration, and deployment of systems.",
  "pos_2_title": "Founding Member and Secretary of Cultural Association",
  "pos_2_company": "Badaloca Cultural Association",
  "pos_2_years": "2020 — Present",
  "pos_2_desc": "Founding member and secretary of a local non-profit cultural association focused on promoting artistic and cultural events in the parish of Alvalade do Sado. Web development of the event website Alvalade Arise (www.alvaladearise.com).",
  
  "projects_title": "Projects",
  "project_1_title": "SGAE - Student Accommodation Management System",
  "project_1_desc": "Web platform for student accommodation listings.",
  "project_1_details": "SGAE was designed to centralize and simplify the search for accommodation by students of the Polytechnic Institute of Beja.",
  "project_1_details_2": "Some of the main features include: user authentication for two types (owners and students), creation and management of accommodation listings, search system with advanced filters (location, price, type of accommodation), administration panel for content moderation and user management, and a responsive design for mobile device access. Another implemented feature was the ability to enable and disable ad moderation, allowing greater control over the content published on the platform.",
  "project_1_details_3": "The platform was developed using Laravel MVC, providing a robust and scalable structure. The database modeling was optimized to support future expansions and was implemented with MySQL. For the administration panel, the Fillament package was used. For authentication, Laravel Fortify was used, and Spatie was used for user permissions and roles management. The frontend was developed with Bootstrap, also using the SASS tool.",
  "project_1_details_4": "This project was a collaborative effort, developed by me and another colleague over a semester, as part of the Integrated Project course in the 2023/2024 academic year.",
  
  "project_2_title": "Rate-a-Beer",
  "project_2_desc": "Web platform for rating craft beers.",
  "project_2_details": "The goal of this project was to create a web platform for rating craft beers, where producers can showcase their products and enthusiasts can discover new beers, rate them, and contribute to a community focused on sharing experiences. This is a project I was very excited to work on. Besides considering it to be very well-executed, I find it an interesting proposal that, as a craft beer enthusiast, I would find very useful for cataloging the different beers I have tried.",
  "project_2_details_2": "The platform consists of a REST API, developed in the Web Application Development course. This API, developed in PHP with the Laravel framework, complemented by a MySQL database, provided the necessary structure to implement: secure registration and authentication, with the help of the Laravel Fortify package; Submission of new beers by producers; Search for beers and brands through various filters; Beer rating by registered users; and Permissions and roles management, integrated with the Spatie package.",
  "project_2_details_3": "For the front-end, developed in the Web Technologies and Mobile Environments course, I used React.js to create a clean, accessible, and responsive interface for the project's front end.",
  
  "project_3_title": "Android Launcher for Enhanced Accessibility",
  "project_3_desc": "Android launcher focused on accessibility for the elderly and people with similar accessibility needs.",
  "project_3_details": "This project had as one of its main focuses to make smartphones more accessible for elderly people, facilitating the integration of this population group into the digital world. This Android launcher, developed in Kotlin, offers a simplified interface with large, easy-to-identify icons, quick access to essential phone functions such as calls, messages, and camera, and the inclusion of an SOS function that allows users to quickly send an emergency message with their location to predefined contacts.",
  "project_3_details_2": "If all projects should consider user experience, in this case, this aspect was entirely central to how the launcher was designed and developed.",
  "project_3_details_3": "This project was developed in a team, including two other colleagues, as part of the Mobile Device Programming course in the 2024/2025 academic year.",
  
  "project_4_title": "GASPAR - Gas Protection Automated Response",
  "project_4_desc": "Gas detection system with IoT integration for remote monitoring.",
  "project_4_details": "GASPAR is a gas detection system developed with the goal of proving a concept rather than being a complex project. The aim was to try to create something useful using as many plug-and-play resources as possible, showing that it is possible to create practical solutions with a limited budget and accessible components.",
  "project_4_details_2": "The core of the system is an Arduino UNO R4 Wifi, equipped with an MQ-2 gas sensor that, upon detecting potentially dangerous gas levels, sends notifications to a smartphone via the IFTTT (If This Then That (https://ifttt.com/)) service to alert users. The system also integrates an on-site alarm to immediately warn people nearby. For continuous monitoring, sensor data is sent to the Arduino Cloud, where it can be viewed in real-time through a dedicated dashboard.",
  "project_4_details_3": "This project was developed as part of the Applied Physics to Computing course in the 2023/2024 academic year.",

  "contact_title": "Contacts",
  "contact_text": "Email: your.email@example.com — LinkedIn: your-linkedin",
  "hero_image_alt": "imagem comemorativa",
  "copyright": "© 2025 Leonardo Benvinda"
}