{
  "title": "Portefólio — Leonardo Benvinda",
  "nav_about": "Sobre",
  "nav_projects": "Projetos",
  "nav_contact": "Contactos e Redes Sociais",
  "cat_academic": "Académicos",
  "cat_professional": "Profissionais",
  "cat_personal": "Pessoais",
  "cat_all": "Todos",
  "hero_title": "Leonardo Benvinda",
  "hero_sub": "Licenciado em Engenharia Informática.",
  "btn_view_projects": "Projetos",
  "btn_contact": "Contactos e Redes Sociais",
  "btn_cv_en": "Descarregar CV (EN)",
  "btn_cv_pt": "Descarregar CV (PT)",
  "about_title": "Sobre",
  "about_text": "Sou entusiasmado por tecnologia desde que me lembro. Os meus interesses são tão variados como desenvolvimento de software, IoT, Inteligência Artificial, administração de sistemas, reparação e manutenção de hardware, entre outras áreas. Gosto de desafios práticos, mas também valorizo muito a teoria e o planeamento por trás de um bom projeto. Acredito que a tecnologia deve ser usada para melhorar a vida das pessoas e estou sempre à procura de novas formas de aprender e crescer nesta área em constante evolução. Os diferentes tipos de projetos que desenvolvi ao longo dos anos refletem esta minha curiosidade por diversas áreas. Concluí recentemente a minha licenciatura em Engenharia Informática, onde adequiri e aprofundei conhecimentos em várias áreas e procuro agora a minha primeira experiência profissional na área.",

  "education_title": "Formação",
  "edu_1_degree": "Licenciatura em Engenharia Informática",
  "edu_1_institution": "Escola Superior de Tecnologia e Gestão - Instituto Politécnico de Beja",
  "edu_1_years": "2022 — 2025",
  "edu_1_desc": "Curso bastante prático com enfâse em programação orientada a objetos (POO), desenvolvimento web e scripting. Projeto final: Desenvolvimento de uma solução de video vigilância móvel com transmissão em tempo real e controlo remoto via aplicação web - 20 valores. Média Final: 16 valores.",
  "edu_2_degree": "Ensino Secundário - Técnico de Informática de Gestão",
  "edu_2_institution": "Escola Tecnológica do Litoral Alentejano (ETLA)",
  "edu_2_years": "2015 — 2018",
  "edu_2_desc": "Foco principal em programação orientada a objetos e bases de dados. Projeto Final: Software de gestão de um clínica médica - 19/20. Média final: 16/20.",

  "positions_title": "Experiência profissional",
  "pos_1_title": "Técnico de Informática",
  "pos_1_company": "Escola Tecnológica do Litoral Alentejano (ETLA)",
  "pos_1_years": "2019 — 2022",
  "pos_1_desc": "Desenvolvimento de aplicações internas na área da gestão. Instalação, manutenção e reparação de hardware e software em computadores e redes da escola. Suporte técnico a alunos e professores. Preparação, configuração e deployment de sistemas.",
  "pos_2_title": "Membro fundador e Secretário de Associação Cultural",
  "pos_2_company": "Badaloca Associação Cultural",
  "pos_2_years": "2020 — Presente",
  "pos_2_desc": "Membro fundador e secretário de associação cultural local e sem fins lucrativos, com foco na promoção de eventos artísticos e culturais na freguesia de Alvalade do Sado. Desenvolvimento web do site do evento Alvalade Arise ( www.alvaladearise.com ).",
  "pos_1_skill_csharp": "C#",
  "pos_1_skill_vbnet": "VB.NET",
  "pos_1_skill_sql": "SQL",
  "pos_1_skill_hardware_troubleshooting": "Resolução de problemas de hardware",
  "pos_2_skill_leadership": "Liderança",
  "pos_2_skill_communication": "Comunicação",
  "pos_2_skill_problem_solving": "Resolução de problemas",
  "pos_2_skill_team_work": "Trabalho em equipa",
  "pos_2_skill_sense_of_responsibility": "Sentido de responsabilidade",

  "projects_title": "Projetos",
  "project_1_title": "SGAE - Sistema de Gestão de Alojamento para Estudantes",
  "project_1_desc": "Plataforma web para divulgação de alojamento estudantil.",
  "project_1_details": "O SGAE foi concebido para centralizar e facilitar a procura de alojamento por parte dos estudantes do Instituto Politécnico de Beja.",
  "project_1_details_2": "Algumas das funcionalidades principais incluem: autenticação de utilizadores de dois tipos (proprietários e estudantes), criação e gestão de anúncios de alojamento, sistema de pesquisa com filtros avançados (localização, preço, tipo de alojamento), painel de administração para moderação de conteúdos e gestão de utilizadores, e um design responsivo para acesso em dispositivos móveis. Outra funcionalidade implementada foi a possibilidade de ativar e desativar a moderação de anúncios, permitindo maior controlo sobre o conteúdo publicado na plataforma.",
  "project_1_details_3": "A plataforma foi desenvolvida utilizando Laravel MVC, proporcionando uma estrutura robusta e escalável. A modelação da base de dados foi otimizada para suportar futuras expansões, e foi implementada com MySQL. Para o painel de administração utilizou-se o pacote Fillament. Para autenticação utilizou-se o Laravel Fortify e o Spatie para a gestão de permissões e papéis dos utilizadores. O frontend foi desenvolvido com Bootstrap recorrendo também à ferramenta SASS.",
  "project_1_details_4": "Este projeto foi um esforço colaborativo, desenvolvido por mim e mais um colega ao longo de um semestre, na unidade curricular de Projeto Integrado no ano letivo de 2023/2024.",

  "project_2_title": "Rate-a-Beer",
  "project_2_desc": "Plataforma web para avaliação de cervejas artesanais.",
  "project_2_details": "O objetivo deste projeto foi criar uma plataforma web para avaliação de cervejas artesanais, onde produtores podem divulgar os seus produtos e entusiastas podem descobrir novas cervejas, avaliá-las e contribuir para uma comunidade focada na partilha de experiências. Este é um projeto que me entusiasmou muito fazer. Para além de considerar que foi muito bem conseguido, acho uma proposta interessante que, a mim como apreciador de cerveja artesanal, me daria muito jeito para catalogar as diferentes cervejas que já provei.",
  "project_2_details_2": "A plataforma é composta por uma REST API, desenvolvida na unidade curricular de Desenvolvimento de Aplicações Web. Esta API desenvolvida em PHP com a framework Laravel, complementada com uma base de dados MySQL, forneceu a estrutura necessária para implementar: registo e autenticação segura, com auxílio do pacote Laravel Fortify; Submissão de novas cervejas por parte dos produtores; Pesquisa de cervejas e marcas através de vários filtros; Avaliação de cervejas por utilizadores registados e Gestão de permissões e papéis, integrados com o pacote Spatie.",
  "project_2_details_3": "Para o front-end, desenvolvido na unidade curricular de Tecnologias Web e Ambientes Móveis, utilizei React.js para criar uma interface limpa, acessível e responsiva para a face deste projeto.",

  "project_3_title": "Launcher Android de Acessibilidade Aumentada",
  "project_3_desc": "Launcher Android focado em acessibilidade para idosos e pessoas com necessidades de acessibilidade semelhantes.",
  "project_3_details": "Este projeto tinha como um dos focos principais tentar tornar o smartphone mais acessível para pessoas idosas, facilitando a integração deste setor populacional no mundo digital. Este launcher android desenvolvido em Kotlin oferece uma interface simplificada com ícones grandes e fáceis de identificar, acesso rápido às funções essenciais do telefone, como chamadas, mensagens e câmera, e a inclusão de uma função de SOS que permite aos utilizadores enviar rapidamente uma mensagem de emergência com a sua localização para contactos pré-definidos.",
  "project_3_details_2": "Se todos os projetos devem ter em conta a experiência do utilizador, neste caso, este aspeto foi totalmente central à forma como o launcher foi concebido e desenvolvido.",
  "project_3_details_3":"Este projeto foi desenvolvido em equipa, incluindo outros dois colegas, no âmbito da unidade curricular Programação de Dispositivos Móveis no ano letivo 2024/2025.",

  "project_4_title": "GASPAR - Gas Protection Automated Resposnse",
  "project_4_desc": "Sistema de deteção de gás com integração IoT para monitorização remota.",
  "project_4_details": "O GASPAR é um sistema de deteção de gás desenvolvido com o objetivo de provar um ponto do que própriamente de ser um projeto complexo. O objetivo era tentar fazer algo útil utilizando o máximo de recursos plug-and-play, mostrando que é possível criar soluções práticas com um orçamento limitado e componentes acessíveis.",
  "project_4_details_2": "O núcleo do sistema é um Arduino UNO R4 Wifi, equipado com um sensor de gás MQ-2 que, ao detectar níveis potêncialmente perigosos de gás, envia notificações para um smartphone através do serviço IFTTT (If This Then That (https://ifttt.com/)) para alertar os utilizadores. O sistema também integra um alarme on-site para avisar imediatamente as pessoas nas proximidades. Para monitorização contínua, os dados do sensor são enviados para o Arduino Cloud, onde podem ser visualizados em tempo real através de um dashboard dedicado.",
  "project_4_details_3":"Este projeto foi desenvolvido no âmbito da unidade curricular de Física Aplicada à Computação no ano letivo 2023/2024.",

  "project_5_title": "Sokoban",
  "project_5_desc": "Um versão do jogo clássico Sokoban desenvolvido em Java, com interface gráfica JavaFX",
  "project_5_details": "O foco deste projeto era desenvolver código limpo e bem organizado, utilizando o padrão de design MVC (Model-View-Controller) para separar a lógica do jogo, a interface do utilizador e o controlo do fluxo do jogo. O jogo inclui funcionalidades como múltiplos níveis, sistema de pontuação, funções de undo e redo para os movimentos do jogador, e a capacidade de salvar e carregar o progresso do jogo, refazendo os passos dados pelo jogador. A interface gráfica foi desenvolvida utilizando JavaFX, proporcionando uma experiência visual agradável e interativa para os jogadores.",
  "project_5_details_2":"Durante o desenvolvimento, recorri a conceitos mais avançados de Java, como records, enums, interfaces, herança e polimorfismo, para garantir que o código fosse eficiente e fácil de manter.",
  "project_5_details_3":"Sendo o enfâse a qualidade do código, foram também criados testes para as principais funcionalidades do jogo, garantindo a sua robustez e fiabilidade.",
  "project_5_details_4":"Este foi um projeto em duplamente, desenvolvido com um colega, no âmbito da unidade curricular de Programação Orientada a Objetos no ano letivo 2022/2023.",

  "project_6_title": "Previsão de resultados de futebol com Machine Learning",
  "project_6_desc": "Treino de modelos de Machine Learning para prever resultados de jogos de futebol, utilizando apenas dados estatísticos.",
  "project_6_details": "Este projeto explora a aplicação de algoritmos de machine learning para prever resultados de jogos de futebol (vitória da casa, empate ou vitória visitante), recorrendo ao software Orange e a um conjunto de dados extraído do Kaggle, baseado no Transfermarkt. Foram treinados vários modelos, incluindo Regressão Logística, Árvore de Decisão, Rede Neural, Random Forest, kNN (K-Nearest Neighbors) e Gradient Boosting.",
  "project_6_details_2": "Um dos principais objetivos deste projeto foi avaliar o desemprenho destes modelos utilizando apenas dados estatísticos, sem recorrer a informações contextuais ou subjetivas, como no caso de casas de aposta, que incluem nos seus calculos fatores de palpite humano. Como variáveis preditoras, foram considerados os ultimos 5 resultados anteriores das equipas, tanto entre si, como individualmente. Como dados de treino foram utilizados dados entre 2013 e 2021, para teste os dados de 2022 e 2023, e utilizou-se para previsão os dados de 2024.",
  "project_6_details_3": "Os modelos referidos foram avaliados com base nas métricas de Acurácia, Precisão, Recall e F1-Score. O modelo que obteve o melhor desempenho foi o Gradient Boosting, conseguindo os melhores valores de todos os indicadores mencionados. A matriz de confusão revela ainda uma precisão considerável de 54.8% na previsão de empates, que são tradicionalmente mais difíceis de prever devido à sua natureza imprevisível.",
  "project_6_details_4": "Para a limpeza e preparação dos dados utilizei python, enquanto os modelos de machine learning foram treinados e avaliados utilizando o software Orange.",
  "project_6_details_5": "Para além do treino e avaliação dos modelos, escrevi um artigo detalhado que descreve não só o processo de desenvolvimento, mas uma análise mais aprofundada aos resultados obtidos e às suas implicações no contexto da previsão de resultados desportivos. Esse artigo pode ser consultado através do link abaixo.",
  "project_6_details_6": "Este projeto foi desenvolvido no âmbito da unidade curricular de Sistemas de Informação, durante o ano letivo de 2024/2025.",
  "project_6_file_label": "Descarregar o artigo completo (PDF)",

  "project_7_title": "ARU - Aplicação do Relatório Único",
  "project_7_desc": "Software de tratamento de dados para submissão do Relatório Único à Segurança Social.",
  "project_7_details": "Enquanto colaborador da ETLA, desenvolvi uma plicação desktop em C# para automatizar o tratamento de dados necessários para a submissão do anexo C do Relatório Único à segurança social (https://help.factorialhr.com/pt_PT/formacao/como-preencher-o-anexo-c-do-relatorio-unico). Um processo que anteriormente era feito através de multiplas e complexas fohas de cálculo Excel, é agora simplificado com esta aplicação.",
  "project_7_details_2": "Esta aplicação foi das mais ricas em desafios ligados a integração com outros sistemas. Os dados eram extraídos de diversos sistemas de gestão para folhas excel, pelo que o seu formato e estrutura não eram consistentes. A ARU foi desenvolvido com esta particularidade em mente, pelo que inclui uma funcionalidade de leitura de 'headers' para tentar mapear automaticamente os dados de entrada para o formato esperado pela aplicação. Quando os headers não são reconhecidos, o utilizador pode mapear manualmente os campos, garantindo assim a flexibilidade necessária para lidar com diferentes fontes de dados.",
  "project_7_details_3": "Contando com o erro humano como um fator inevitável, a aplicação inclui ainda um sistema de deteção de registos duplicados, alertando o utilizador para possíveis inconsistências nos dados antes da geração do ficheiro final. Após o processamento e validação dos dados, a aplicação gera um ficheiro no formato XML, pronto para submissão à Segurança Social, simplificando significativamente o processo e reduzindo o risco de erros.",
  "project_7_details_4": "Foi ainda implementada uma funcionalidade que permitia preencher automáticamente alguns dados do formulário com base em dados históricos, reduzindo ainda mais o tempo necessário para completar o relatório. Esta funcionalidade foi implementada utilizando uma versão do algoritmo de Levensthein para comparar nomes de formações dadas ao colaboradores, identificando assim os seus temas dentro dos disponíveis na tabela oficial da Segurança Social.",
  "project_7_details_5": "Por motivos de confidencialidade, não posso partilhar capturas de ecrã ou detalhes específicos do código fonte deste projeto.",
  

  "project_8_title": "Balançómetro - Software de Inventário para Microempresas",
  "project_8_desc": "Software de inventário simples desenvolvido em C#",
  "project_8_details": "O Balançómetro é um software de inventário que desenvolvi para colmatar a necessidade de uma empresa familiar que não possuí contabilidade organizada. Todos os anos, para aprentar o balanço à Autoridade Tributária, era necessário fazer um inventário manual de todos os produtos em stock, o que consumia muito tempo e era propenso a erros.",
  "project_8_details_2": "Para facilitar este processo, criei este software em C# que permite importar a lista de produtos exportada pelo sistema POS em formato .xslx e inserir as quantidades atuais em stock, atualizar preços, e gerar então outra folha excel pronta para ser entregue à contabilidade. A principal vantagem deste software é as funções implementadas de pesquisa, que permitem encontrar rapidamente produtos por nome, código ou preço, facilitando a atualização dos dados.",
  "project_8_details_3": "Pode ser visto como um projeto simples, mas nem por isso deixou de ter um grande impacto na eficiência do processo de inventário anual desta microempresa.",
  

  "project_9_title": "VMK - Virtual MIDI Keyboard",
  "project_9_desc": "Software de mapeamento de teclado qwerty para envio de comandos MIDI.",
  "project_9_details": "Este é um projeto que ansce de uma necessidade pessoal. Como músico amador, há algum tempo que utilizo software de modelação de som para evitar a compra de hardware dispêndioso. Muito deste software pode ser controlado via comandos MIDI, normalmente emitido por teclados ou outros dispositivos MIDI.",
  "project_9_details_2": "Dito isto, sempre achei que utilizar um teclado especifíco apenas para controlar um software que corre num computador comum era um pouco redeundante. Não poderia simplesmente usar um teclado comum para enviar estes comandos MIDI? Depois de alguma pesquisa não encontrei grandes soluções viàveis, pelo que decidi desenvolver o meu próprio software para o efeito. O VMK é um software desenvolvido em C# que me permite mapear teclas de um teclado comum, definir comandos MIDI específicos para cada tecla e assim controlar software de modelação de som sem a necessidade de hardware adicional.",
  "project_9_details_3": "É um projeto pessoal que ainda está numa fase muito inicial, mas que nos ultimos testes já permitiu enviar comandos MIDI básicos. Ainda não tem uma interface visual, ou a possibildiade de mapear teclas, pelo que tanto os comandos como as teclas mapeadas ainda são hardcoded. No entanto, é um projeto que pretendo continuar a desenvolver no meu tempo livre e, quem sabe, um dia torná-lo numa ferramenta útil para outros músicos amadores como eu.",

  "contact_title": "Contactos",
  "copyright": "© 2025 Leonardo Benvinda"
}