{
  "title": "Portefólio — Leonardo Benvinda",
  "nav_about": "Sobre",
  "nav_projects": "Projetos",
  "nav_contact": "Contactos e Redes Sociais",
  "cat_academic": "Académicos",
  "cat_professional": "Profissionais",
  "cat_personal": "Pessoais",
  "hero_title": "Leonardo Benvinda",
  "hero_sub": "Licenciado em Engenharia Informática.",
  "btn_view_projects": "Projetos",
  "btn_contact": "Contactos e Redes Sociais",
  "about_title": "Sobre",
  "about_text": "Sou entusiasmado por tecnologia desde que me lembro. Os meus interesses são tão variados como desenvolvimento de software, IoT, Inteligência Artificial, administração de sistemas, reparação e manutenção de hardware, entre outras áreas. Gosto de desafios práticos, mas também valorizo muito a teoria e o planeamento por trás de um bom projeto. Acredito que a tecnologia deve ser usada para melhorar a vida das pessoas e estou sempre à procura de novas formas de aprender e crescer nesta área em constante evolução. Os diferentes tipos de projetos que desenvolvi ao longo dos anos refletem esta minha curiosidade por diversas áreas. Concluí recentemente a minha licenciatura em Engenharia Informática, onde adequiri e aprofundei conhecimentos em várias áreas e procuro agora a minha primeira experiência profissional na área.",

  "education_title": "Formação",
  "edu_1_degree": "Licenciatura em Engenharia Informática",
  "edu_1_institution": "Escola Superior de Tecnologia e Gestão - Instituto Politécnico de Beja",
  "edu_1_years": "2022 — 2025",
  "edu_1_desc": "Curso bastante prático com enfâse em programação orientada a objetos (POO), desenvolvimento web e scripting. Projeto final: Desenvolvimento de uma solução de video vigilância móvel com transmissão em tempo real e controlo remoto via aplicação web - 20 valores. Média Final: 16 valores.",
  "edu_2_degree": "Ensino Secundário - Técnico de Informática de Gestão",
  "edu_2_institution": "Escola Tecnológica do Litoral Alentejano (ETLA)",
  "edu_2_years": "2015 — 2018",
  "edu_2_desc": "Foco principal em programação orientada a objetos e bases de dados. Projeto Final: Software de gestão de um clínica médica - 19/20. Média final: 16/20.",

  "positions_title": "Experiência profissional",
  "pos_1_title": "Técnico de Informática",
  "pos_1_company": "Escola Tecnológica do Litoral Alentejano (ETLA)",
  "pos_1_years": "2019 — 2022",
  "pos_1_desc": "Desenvolvimento de aplicações internas na área da gestão. Instalação, manutenção e reparação de hardware e software em computadores e redes da escola. Suporte técnico a alunos e professores. Preparação, configuração e deployment de sistemas.",
  "pos_2_title": "Membro fundador e Secretário de Associação Cultural",
  "pos_2_company": "Badaloca Associação Cultural",
  "pos_2_years": "2020 — Presente",
  "pos_2_desc": "Membro fundador e secretário de associação cultural local e sem fins lucrativos, com foco na promoção de eventos artísticos e culturais na freguesia de Alvalade do Sado. Desenvolvimento web do site do evento Alvalade Arise ( www.alvaladearise.com ).",

  "projects_title": "Projetos",
  "project_1_title": "SGAE - Sistema de Gestão de Alojamento para Estudantes",
  "project_1_desc": "Plataforma web para divulgação de alojamento estudantil.",
  "project_1_details": "O SGAE foi concebido para centralizar e facilitar a procura de alojamento por parte dos estudantes do Instituto Politécnico de Beja.",
  "project_1_details_2": "Algumas das funcionalidades principais incluem: autenticação de utilizadores de dois tipos (proprietários e estudantes), criação e gestão de anúncios de alojamento, sistema de pesquisa com filtros avançados (localização, preço, tipo de alojamento), painel de administração para moderação de conteúdos e gestão de utilizadores, e um design responsivo para acesso em dispositivos móveis. Outra funcionalidade implementada foi a possibilidade de ativar e desativar a moderação de anúncios, permitindo maior controlo sobre o conteúdo publicado na plataforma.",
  "project_1_details_3": "A plataforma foi desenvolvida utilizando Laravel MVC, proporcionando uma estrutura robusta e escalável. A modelação da base de dados foi otimizada para suportar futuras expansões, e foi implementada com MySQL. Para o painel de administração utilizou-se o pacote Fillament. Para autenticação utilizou-se o Laravel Fortify e o Spatie para a gestão de permissões e papéis dos utilizadores. O frontend foi desenvolvido com Bootstrap recorrendo também à ferramenta SASS.",
  "project_1_details_4": "Este projeto foi um esforço colaborativo, desenvolvido por mim e mais um colega ao longo de um semestre, na unidade curricular de Projeto Integrado no ano letivo de 2023/2024.",

  "project_2_title": "Rate-a-Beer",
  "project_2_desc": "Plataforma web para avaliação de cervejas artesanais.",
  "project_2_details": "O objetivo deste projeto foi criar uma plataforma web para avaliação de cervejas artesanais, onde produtores podem divulgar os seus produtos e entusiastas podem descobrir novas cervejas, avaliá-las e contribuir para uma comunidade focada na partilha de experiências. Este é um projeto que me entusiasmou muito fazer. Para além de considerar que foi muito bem conseguido, acho uma proposta interessante que, a mim como apreciador de cerveja artesanal, me daria muito jeito para catalogar as diferentes cervejas que já provei.",
  "project_2_details_2": "A plataforma é composta por uma REST API, desenvolvida na unidade curricular de Desenvolvimento de Aplicações Web. Esta API desenvolvida em PHP com a framework Laravel, complementada com uma base de dados MySQL, forneceu a estrutura necessária para implementar: registo e autenticação segura, com auxílio do pacote Laravel Fortify; Submissão de novas cervejas por parte dos produtores; Pesquisa de cervejas e marcas através de vários filtros; Avaliação de cervejas por utilizadores registados e Gestão de permissões e papéis, integrados com o pacote Spatie.",
  "project_2_details_3": "Para o front-end, desenvolvido na unidade curricular de Tecnologias Web e Ambientes Móveis, utilizei React.js para criar uma interface limpa, acessível e responsiva para a face deste projeto.",

  "project_3_title": "Launcher Android de Acessibilidade Aumentada",
  "project_3_desc": "Launcher Android focado em acessibilidade para idosos e pessoas com necessidades de acessibilidade semelhantes.",
  "project_3_details": "Este projeto tinha como um dos focos principais tentar tornar o smartphone mais acessível para pessoas idosas, facilitando a integração deste setor populacional no mundo digital. Este launcher android desenvolvido em Kotlin oferece uma interface simplificada com ícones grandes e fáceis de identificar, acesso rápido às funções essenciais do telefone, como chamadas, mensagens e câmera, e a inclusão de uma função de SOS que permite aos utilizadores enviar rapidamente uma mensagem de emergência com a sua localização para contactos pré-definidos.",
  "project_3_details_2": "Se todos os projetos devem ter em conta a experiência do utilizador, neste caso, este aspeto foi totalmente central à forma como o launcher foi concebido e desenvolvido.",
  "project_3_details_3":"Este projeto foi desenvolvido em equipa, incluindo outros dois colegas, no âmbito da unidade curricular Programação de Dispositivos Móveis no ano letivo 2024/2025.",

  "project_4_title": "GASPAR - Gas Protection Automated Resposnse",
  "project_4_desc": "Sistema de deteção de gás com integração IoT para monitorização remota.",
  "project_4_details": "O GASPAR é um sistema de deteção de gás desenvolvido com o objetivo de provar um ponto do que própriamente de ser um projeto complexo. O objetivo era tentar fazer algo útil utilizando o máximo de recursos plug-and-play, mostrando que é possível criar soluções práticas com um orçamento limitado e componentes acessíveis.",
  "project_4_details_2": "O núcleo do sistema é um Arduino UNO R4 Wifi, equipado com um sensor de gás MQ-2 que, ao detectar níveis potêncialmente perigosos de gás, envia notificações para um smartphone através do serviço IFTTT (If This Then That (https://ifttt.com/)) para alertar os utilizadores. O sistema também integra um alarme on-site para avisar imediatamente as pessoas nas proximidades. Para monitorização contínua, os dados do sensor são enviados para o Arduino Cloud, onde podem ser visualizados em tempo real através de um dashboard dedicado.",
  "project_4_details_3":"Este projeto foi desenvolvido no âmbito da unidade curricular de Física Aplicada à Computação no ano letivo 2023/2024.",

  "project_5_title": "Rate-a-Beer (Laravel)",
  "project_5_desc": "API REST, MySQL, produtores & apreciadores, análises.",
  "project_5_details": "Rate-a-Beer: aplicação Laravel com API REST, base de dados MySQL, autenticação e painéis analíticos. Suporta papéis de produtores e apreciadores, avaliações e reviews.",
  "project_6_title": "Rate-a-Beer (Laravel)",
  "project_6_desc": "API REST, MySQL, produtores & apreciadores, análises.",
  "project_6_details": "Rate-a-Beer: aplicação Laravel com API REST, base de dados MySQL, autenticação e painéis analíticos. Suporta papéis de produtores e apreciadores, avaliações e reviews.",
  "project_7_title": "Rate-a-Beer (Laravel)",
  "project_7_desc": "API REST, MySQL, produtores & apreciadores, análises.",
  "project_7_details": "Rate-a-Beer: aplicação Laravel com API REST, base de dados MySQL, autenticação e painéis analíticos. Suporta papéis de produtores e apreciadores, avaliações e reviews.",
  "project_8_title": "Rate-a-Beer (Laravel)",
  "project_8_desc": "API REST, MySQL, produtores & apreciadores, análises.",
  "project_8_details": "Rate-a-Beer: aplicação Laravel com API REST, base de dados MySQL, autenticação e painéis analíticos. Suporta papéis de produtores e apreciadores, avaliações e reviews.",
  "project_9_title": "Rate-a-Beer (Laravel)",
  "project_9_desc": "API REST, MySQL, produtores & apreciadores, análises.",
  "project_9_details": "Rate-a-Beer: aplicação Laravel com API REST, base de dados MySQL, autenticação e painéis analíticos. Suporta papéis de produtores e apreciadores, avaliações e reviews.",

  "contact_title": "Contacto",
  "contact_text": "Email: your.email@example.com — LinkedIn: your-linkedin",
  "hero_image_alt": "imagem comemorativa",
  "copyright": "© 2025 Leonardo Benvinda"
}