{
  "title": "Portefólio — Leonardo Benvinda",
  "nav_about": "Sobre",
  "nav_projects": "Projetos",
  "nav_contact": "Contactos e Redes Sociais",
  "cat_academic": "Académicos",
  "cat_professional": "Profissionais",
  "cat_personal": "Pessoais",
  "hero_title": "Leonardo Benvinda, Desenvolvedor de Software e Engenheiro Informático",
  "hero_sub": "Desenvolvo software e sistemas embebidos. Explora os projetos abaixo.",
  "btn_view_projects": "Projetos",
  "btn_contact": "Contactos e Redes Sociais",
  "about_title": "Sobre",
  "about_text": "Concluí recentemente a Licenciatura em Engenharia Informática. O meu trabalho abrange desenvolvimento web, sistemas embebidos e projetos de dados. Valorizo código limpo, boa arquitectura e resultados práticos.",
  "education_title": "Formação",
  "edu_1_degree": "Licenciatura em Engenharia Informática",
  "edu_1_institution": "Escola Superior de Tecnologia e Gestão - Instituto Politécnico de Beja",
  "edu_1_years": "2022 — 2025",
  "edu_1_desc": "Curso bastante prático com enfâse em programação orientada a objetos (POO), desenvolvimento web e scripting. Projeto final: Desenvolvimento de uma solução de video vigilância móvel com transmissão em tempo real e controlo remoto via aplicação web - 20 valores. Média Final: 16 valores.",
  "edu_2_degree": "Ensino Secundário - Técnico de Informática de Gestão",
  "edu_2_institution": "Escola Tecnológica do Litoral Alentejano (ETLA)",
  "edu_2_years": "2015 — 2018",
  "edu_2_desc": "Foco principal em programação orientada a objetos e bases de dados. Projeto Final: Software de gestão de um clínica médica - 19/20. Média final: 16/20.",
  "positions_title": "Experiência profissional",
  "pos_1_title": "Técnico de Informática",
  "pos_1_company": "Escola Tecnológica do Litoral Alentejano (ETLA)",
  "pos_1_years": "2019 — 2022",
  "pos_1_desc": "Desenvolvimento de aplicações internas na área da gestão. Instalação, manutenção e reparação de hardware e software em computadores e redes da escola. Suporte técnico a alunos e professores. Preparação, configuração e deployment de sistemas.",
  "pos_2_title": "Membro fundador e Secretário de Associação Cultural",
  "pos_2_company": "Badaloca Associação Cultural",
  "pos_2_years": "2020 — Presente",
  "pos_2_desc": "Membro fundador e secretário de associação cultural local e sem fins lucrativos, com foco na promoção de eventos artísticos e culturais na freguesia de Alvalade do Sado. Desenvolvimento web do site do evento Alvalade Arise ( www.alvaladearise.com ).",
  "projects_title": "Projetos",
  "project_1_title": "Jogo do Galo (JavaFX)",
  "project_1_desc": "POO, JavaFX, modo PvE que nunca perde, sistema de rankings.",
  "project_2_title": "Sokoban (JavaFX)",
  "project_2_desc": "MVC, código limpo, undo/redo, carregar & replay.",
  "project_3_title": "Detetor de Gás (Arduino)",
  "project_3_desc": "Arduino UNO R4 WiFi, notificações IFTTT, dashboard Arduino Cloud.",
  "project_4_title": "Rate-a-Beer (Laravel)",
  "project_4_desc": "API REST, MySQL, produtores & apreciadores, análises.",
  "project_1_details": "Jogo do Galo implementado em Java e JavaFX. Inclui um adversário PvE com IA, sistema de rankings local e interface responsiva. Enfase em design OOP e testes unitários para a lógica do jogo.",
  "project_2_details": "Sokoban desenvolvido em Java com arquitetura MVC. Funcionalidades: undo/redo, carregamento de níveis e reprodução (replay). Foco em código manutenível e parsing de níveis.",
  "project_3_details": "Detetor de Gás com Arduino UNO R4 WiFi. Integra leituras de sensores MQ, notificações IFTTT e dashboard no Arduino Cloud. Inclui notas de calibração e optimização de consumo.",
  "project_4_details": "Rate-a-Beer: aplicação Laravel com API REST, base de dados MySQL, autenticação e painéis analíticos. Suporta papéis de produtores e apreciadores, avaliações e reviews.",
  "contact_title": "Contacto",
  "contact_text": "Email: your.email@example.com — LinkedIn: your-linkedin",
  "hero_image_alt": "imagem comemorativa",
  "copyright": "© 2025 Leonardo Benvinda"
}